ut.ДоработкиАурум/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0a070a8-fff5-49fe-8c9e-3fbae30394cb">
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8352fa6-99c0-4f4b-9227-b1ac7d158a3e">
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f70eac4-2b8c-4400-9fb7-f3d4230ad33e">
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1270ac55-6965-4dae-b63b-1266cf1cca2a">
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ut.ДоработкиАурум/src/CommonModules/РаспознаваниеДокументовСлужебный/Module.bsl
#Область ПрограммныйИнтерфейс

&ИзменениеИКонтроль("ЗаполнитьСозданныйДокументИзРаспознанногоДокументаБРДОбработчик")
Процедура АУ_ЗаполнитьСозданныйДокументИзРаспознанногоДокументаБРДОбработчик(Источник, ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("Основание")
		И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.РаспознанныйДокумент") Тогда
		
		МетаданныеОбъекта = Источник.Метаданные();
		ЕстьТаблицаУслуг = НЕ МетаданныеОбъекта.ТабличныеЧасти.Найти("Услуги") = Неопределено;
		ЕстьДоходы = Не МетаданныеОбъекта.ТабличныеЧасти.Найти("Доходы") = Неопределено;
		ЕстьРасходы = Не МетаданныеОбъекта.ТабличныеЧасти.Найти("Расходы") = Неопределено;
		ЕстьПрочиеРасходы = Не МетаданныеОбъекта.ТабличныеЧасти.Найти("ПрочиеРасходы") = Неопределено;
		
		Если (Не ЕстьДоходы Или Не ЕстьРасходы) И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения); 
		
		НДСВключен = Ложь;
	
		Если ЕстьТаблицаУслуг Тогда
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.УслугиРаботы Цикл
				СтрокаУслуга = Источник.Услуги.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаУслуга, ДанныеСтроки);
				НДСВключен = ДанныеСтроки.Сумма = ДанныеСтроки.Всего;
			КонецЦикла;
			Если ЗначениеЗаполнено(ДанныеЗаполнения.ИтогоСуммаНДС) Тогда
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			Иначе
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			КонецЕсли;
		ИначеЕсли Не МетаданныеОбъекта.ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.ТоварыУслуги Цикл
				ЗаполнитьЗначенияСвойств(Источник.Товары.Добавить(), ДанныеСтроки);
				НДСВключен = ДанныеСтроки.Сумма = ДанныеСтроки.Всего;
			КонецЦикла;	
			Если ЗначениеЗаполнено(ДанныеЗаполнения.ИтогоСуммаНДС) Или НДСВключен Тогда
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			Иначе
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			КонецЕсли
		ИначеЕсли ЕстьДоходы Тогда
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.УслугиРаботы Цикл
				ЗаполнитьЗначенияСвойств(Источник.Доходы.Добавить(), ДанныеСтроки);
				НДСВключен = ДанныеСтроки.Сумма = ДанныеСтроки.Всего;
			КонецЦикла;
			Если ЗначениеЗаполнено(ДанныеЗаполнения.ИтогоСуммаНДС) Или НДСВключен Тогда
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			Иначе
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			КонецЕсли;
		ИначеЕсли ЕстьРасходы Тогда
			 Для Каждого ДанныеСтроки Из ДанныеЗаполнения.УслугиРаботы Цикл
				ЗаполнитьЗначенияСвойств(Источник.Расходы.Добавить(), ДанныеСтроки);
				НДСВключен = ДанныеСтроки.Сумма = ДанныеСтроки.Всего;  
				Если ЗначениеЗаполнено(ДанныеЗаполнения.ИтогоСуммаНДС) Или НДСВключен Тогда
					Источник.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
				Иначе
					Источник.ЗакупкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
				 КонецЕсли;
			 КонецЦикла;
		ИначеЕсли ЕстьПрочиеРасходы Тогда
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.ПрочиеРасходы Цикл
				ЗаполнитьЗначенияСвойств(Источник.ПрочиеРасходы.Добавить(), ДанныеСтроки);
			КонецЦикла;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, "ЦенаВключаетНДС")
			И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Основание, "ТипДокумента", Истина)
			= Перечисления.ТипыДокументовРаспознаваниеДокументов.КассовыйЧек Тогда
			
			Источник.ЦенаВключаетНДС = НДСВключен;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ОснованиеСчет")
		И ТипЗнч(ДанныеЗаполнения.ОснованиеСчет) = Тип("ДокументСсылка.РаспознанныйДокумент") Тогда
		
		ЗаполнитьЗначенияСвойств(Источник, ДанныеЗаполнения);

		НДСВключен = Ложь;
		
			Для Каждого ДанныеСтроки Из ДанныеЗаполнения.ТоварыТЧ Цикл
				ЗаполнитьЗначенияСвойств(Источник.Товары.Добавить(), ДанныеСтроки);
				НДСВключен = ДанныеСтроки.Сумма = ДанныеСтроки.Всего;
			КонецЦикла;	
			#Вставка
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("НалогообложениеНДС", Источник.Метаданные()) Тогда
			#КонецВставки
			Если ЗначениеЗаполнено(ДанныеЗаполнения.ИтогоСуммаНДС) Или НДСВключен Тогда
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			Иначе
				Источник.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			КонецЕсли;
			
			Источник.ЦенаВключаетНДС = НДСВключен;

			#Вставка
			КонецЕсли;
			#КонецВставки
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
